tap "adoptopenjdk/openjdk"
tap "carlocab/personal"
tap "eddieantonio/eddieantonio"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
brew "ack"
brew "openjdk"
brew "ammonite-repl"
brew "openssl@1.1"
brew "libssh2"
brew "aria2"
brew "tcl-tk"
brew "asciinema"
brew "atomicparsley"
brew "autopep8"
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "bat"
brew "bfg"
brew "black"
brew "libpng"
brew "glib"
brew "pkg-config"
brew "cheat"
brew "cmake"
brew "cmatrix"
brew "coreutils"
brew "ctags"
brew "czmq"
brew "diff-so-fancy"
brew "dive"
brew "dust"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "flake8"
brew "fzf"
brew "gawk"
brew "gcc"
brew "krb5"
brew "libxml2"
brew "proj"
brew "openblas"
brew "numpy"
brew "gdal"
brew "gifski"
brew "git"
brew "glances"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gotop"
brew "graphviz"
brew "grep"
brew "grip"
brew "highlight"
brew "htop"
brew "httpie"
brew "ifstat"
brew "python@3.8"
brew "libomp"
brew "imagemagick"
brew "jenv"
brew "john-jumbo"
brew "jq"
brew "libsvg"
brew "libzip"
brew "llvm"
brew "lolcat"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "mas"
brew "media-info"
brew "mill"
brew "moreutils"
brew "most"
brew "ncdu"
brew "neofetch"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "node"
brew "nvm"
brew "opencc"
brew "p7zip"
brew "pdfcrack"
brew "peco"
brew "pip-completion"
brew "pipenv"
brew "pipx"
brew "plowshare"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qpdf"
brew "ranger"
brew "rclone"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rust"
brew "sbt"
brew "sc-im"
brew "shc"
brew "shellcheck"
brew "source-highlight"
brew "ssh-copy-id"
brew "supervisor"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "upx"
brew "vim"
brew "watch"
brew "wget"
brew "wrk"
brew "ydiff"
brew "youtube-dl"
brew "carlocab/personal/unrar"
brew "eddieantonio/eddieantonio/imgcat"
brew "heroku/brew/heroku"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "microsoft/mssql-release/msodbcsql17"
brew "microsoft/mssql-release/mssql-tools"
cask "adoptopenjdk8"
cask "alacritty"
cask "betterzip"
cask "bloomrpc"
cask "brave-browser"
cask "charles"
cask "deckset"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-meslo-for-powerline"
cask "font-mononoki-nerd-font"
cask "font-noto-sans-cjk"
cask "font-ubuntumono-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "iina"
cask "iterm2"
cask "jupyter-notebook-viewer"
cask "keycastr"
cask "mdimagesizemdimporter"
cask "mounty"
cask "obs"
cask "openineditor-lite"
cask "openinterminal"
cask "openinterminal-lite"
cask "phantomjs"
cask "postman"
cask "qladdict"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "r"
cask "robo-3t"
cask "rstudio"
cask "sherlock"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "sqlitestudio"
cask "sublime-text"
cask "suspicious-package"
cask "tabula"
cask "transmission"
cask "typora"
cask "visual-studio-code"
cask "webpquicklook"
cask "welly"
cask "xquartz"
cask "zoom"
cask "zoomus"
mas "Annotate", id: 918207447
mas "AS Timer", id: 512464723
mas "AutoMounter", id: 1160435653
mas "BetterSnapTool", id: 417375580
mas "ColorKit", id: 941186109
mas "ColorSlurp", id: 1287239339
mas "CotEditor", id: 1024640650
mas "CSView", id: 1167193104
mas "Easy CSV Editor", id: 1171346381
mas "Gifski", id: 1351639930
mas "iStat Menus", id: 1319778037
mas "LINE", id: 539883307
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Movist", id: 461788075
mas "Quick Colour Picker", id: 1453741555
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
mas "Xnip", id: 1221250572
mas "簡約錄音機", id: 989175722
